---
type: CurtainSystem
namespace: Autodesk.Revit.DB
version: 2024
members: 5
tags: [revit-api, class]
---

# CurtainSystem

`Autodesk.Revit.DB.CurtainSystem` · Revit 2024 · 5 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | AddCurtainGrid | — | `public void AddCurtainGrid ( Reference face )` |
| Method | RemoveCurtainGrid | — | `public void RemoveCurtainGrid ( Reference face )` |
| Property | CurtainGrids | — | `public CurtainGridSet CurtainGrids { get ; }` |
| Property | CurtainSystemType | — | `public CurtainSystemType CurtainSystemType { get ; set ; }` |
| Property | Parameter | — | `` |